Revit 2027 API
ParameterDownloadOptions.SetCategories Method
 Set categories for binding.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCategories(
	ISet<ElementId> categories
)
Public Sub SetCategories (
	categories As ISet(Of ElementId)
)
public:
void SetCategories(
	ISet<ElementId^>^ categories
)
member SetCategories :
        categories : ISet<ElementId> -> unit
Parameters
categories ISet<ElementId>
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterDownloadOptions Class
Autodesk.Revit.DB Namespace